{
    "CTRL+KIDS1": {
        "AU-01": "Olá pessoal, boa noite ! \n Na nossa primeira aula, exploramos a parte robótica do curso, apresentando aos alunos o micro:bit — um microcontrolador pequeno, simples de programar e super versátil, muito usado para ensinar conceitos de programação e eletrônica. \n Também fizemos uma introdução sobre como funciona a robótica em geral, mostrando a relação entre hardware e software e como esses dispositivos executam tarefas. \n Espero vocês na próxima aula, onde vamos explorar ainda mais esse dispositivo tão pequeno, mas que faz coisas incríveis, como o micro:bit!",

        "AU-02": "Eaí galera, tudo bem? \n Na aula de hoje, mergulhamos ainda mais no universo do micro:bit! Aprendemos a usar os LEDs para criar códigos visuais super legais e até a escrever mensagens com texto na telinha do micro:bit — bem massa, né? \n Também descobrimos como usar os comandos Plotar, Pause e Unplot para controlar os LEDs de um jeito dinâmico, fazendo eles acenderem, pausarem e apagarem, abrindo um mundo de possibilidades para criar efeitos incríveis. \n Tô animado para ver vocês na próxima aula, onde vamos continuar explorando esse pequeno dispositivo que tem um potencial gigante!",

        "AU-03": "Fala, galera! Como vocês estão? \n Nessa aula, a gente continuou se aventurando com o micro:bit e descobriu mais funções super úteis! Aprendemos como usar os botões “A” e “B” para interagir com o código — agora dá pra fazer o micro:bit reagir ao toque!",

        "AU-04": "Oi, espero que todos estejam bem ! \n Na aula de hoje, a gente foi além e explorou mais a fundo a matriz de LEDs do micro:bit! Vimos como usar os LEDs de formas criativas e começamos a dar vida às nossas ideias direto na telinha.\n Também aprendemos a usar o bloco de “agitar” e outros modos de entrada super divertidos, mostrando que o micro:bit pode reagir não só aos botões, mas também a movimentos!\n Pra fechar com chave de ouro, criamos o nosso Micro Pet Animado, uma mistura de código, criatividade e diversão. Foi muito legal ver os bichinhos de cada um ganhando forma!\n Na próxima aula tem mais — então bora continuar explorando o poder desse mini computador!",

        "AU-05": "Vamos falar um pouco sobre a aula de hoje: \n Na aula de hoje, entramos na parte mais matemática do micro:bit — e foi super interessante! Conhecemos a aba de blocos matemáticos e exploramos como fazer operações dentro do código, de forma simples e prática.\n Aprendemos a usar o bloco “escolher aleatório”, que permite gerar números de forma dinâmica — uma ferramenta perfeita pra criar jogos e interações mais inteligentes com o micro:bit.\n E pra aplicar tudo isso na prática, construímos nosso próprio jogo de tabuleiro, usando o micro:bit como um dado eletrônico programado. Foi demais ver como a lógica matemática se transforma em algo tão divertido! \n Esse foi o projeto final para a parte de Micro-Bit, agora iremos entrar em outros conteúdos.",

        "AU-06": "Olá, pessoal! Tudo bem por aí?\n Hoje demos um passo importante no nosso aprendizado: começamos a entender melhor o que é a programação e por que ela é tão importante no nosso dia a dia — desde os jogos que jogamos até os aplicativos que usamos!\n Trabalhamos bastante a lógica de programação, usando ideias simples que ajudam o computador a entender o que queremos que ele faça. Também praticamos os famosos algoritmos, que nada mais são do que passos bem organizados pra resolver um problema.\n Foi uma aula cheia de raciocínio, desafios e descobertas! E isso é só o começo... na próxima, vamos colocar ainda mais a mão na massa!",

        "AU-07": "Oi, pessoal! Tudo bem?\n Hoje conhecemos o Kodu Game Lab e aprendemos como funciona sua programação de um jeito divertido e visual.\n Nossa missão foi ajudar o Kodu a sair do labirinto, colocando em prática o que aprendemos!\n Na próxima aula, tem mais desafio esperando por vocês!",

        "AU-08": "E aí, exploradores! Prontos pra mais uma missão?\n Na aula de hoje, soltamos a imaginação e começamos a criar nosso próprio jogo! Cada um desenvolveu o concept de uma nova aventura, pensando em como ela seria, onde se passaria e quais desafios traria.\n Montamos o cenário de um planeta inexplorado, cheio de possibilidades, cores e formas únicas. E pra deixar tudo ainda mais vivo, criamos os habitantes desse planeta, com características próprias e muita criatividade!\n Foi incrível ver tantas ideias ganhando forma — e isso é só o começo! Semana que vem, a jornada continua!",

        "AU-09": "Fala, galera! Tudo certo?\n Hoje nossa aventura pelo espaço continuou com muita programação! Aprendemos a programar a sonda espacial para que ela pudesse ser controlada e explorar o planeta misterioso que criamos.\n Além disso, começamos a implementar o comportamento dos habitantes do nosso planeta, fazendo com que eles reagissem, se movessem e interagissem de forma divertida no cenário.\n Foi uma aula cheia de ação e criatividade — e na próxima tem mais descobertas vindo por aí!",

        "AU-10": "Como vocês estão ? \n Hoje foi dia de deixar nosso jogo ainda mais emocionante! Criamos novos desafios para torná-lo mais dinâmico e divertido de jogar.\n Também aprendemos a programar as condições de vitória e derrota, definindo quando o jogador vence ou perde — o que deixou tudo com mais cara de jogo de verdade!\n E por fim, finalizamos o nosso Kodu Scouters, com cada mundo, personagem e desafio criados por vocês! Foi demais ver a criatividade de todo mundo em ação!\n Essa foi a última aula no KODU, agora iremos entrar em pixel art, venha com a gente pra essa avenura colorida!",

        "AU-11": "E aí, artistas digitais! Tudo certo?\n Hoje começamos uma nova fase cheia de cores e criatividade com a introdução à pixel art — a arte feita pixel por pixel, como nos jogos clássicos!\n Conhecemos a ferramenta Piskel App, super fácil de usar e perfeita pra soltar a imaginação.\n E é claro, colocamos a mão na massa criando nossos próprios desenhos em pixel art, que ficaram incríveis! Mal posso esperar pra ver o que vocês vão inventar nas próximas aulas!",

        "AU-12": "Oi, pessoal! Tudo bem?\n Hoje mergulhamos ainda mais no mundo da pixel art, aprendendo a importância das linhas e silhuetas nos nossos desenhos.\n Também entendemos como criar curvas e círculos usando pixels — detalhes que fazem toda a diferença! Vamos continuar explorando esse estilo único nas próximas aulas!",

        "AU-13": "E aí, criadores de jogos! Tudo certo?\n Na aula de hoje, aprendemos técnicas de luz e sombra para dar mais vida aos nossos desenhos em pixel art! Descobrimos como usar o vacilante pra deixar tudo mais interessante e até criamos nossas próprias paletas de cores.\n Foi massa ver a criatividade de vocês brilhando — literalmente. Espero que tenham entendido a fazer artes em pixeis com esse aplicativo, pois em nossos futuros jogos, criaremos nossos próprios desenhos para utilizar. AGORA ENTRAREMOS EM SCRATCH",
        
        "AU-14": "Eae Scratchers de plantão\n Hoje demos os primeiros passos com o Scratch! Conhecemos a ferramenta e exploramos seus recursos principais, como os blocos de eventos, controle e muito mais. Também aprendemos como funciona o sistema de movimentação e coordenadas pra fazer nossos personagens se mexerem direitinho!\n Primeiro contato incrível — bora continuar criando juntos! 🚀",

        "AU-15": "Professor aqui para dizer que:\n Hoje exploramos mais a fundo no Scratch! Aprendemos a editar fantasias dos personagens e relembramos os conceitos de variáveis, loops e condicionais. Também exploramos os operadores e o recurso de Broadcast, que permite que diferentes partes do projeto se comuniquem.\n Estamos evoluindo muito bem na programação! 🎮💡",

        "AU-16": "Olá, turma!\n Na aula de hoje, demos um passo animado com o Dance Revolution! Aprendemos como sonorizar o projeto, conhecemos melhor como funciona a Makey Makey e ainda tivemos o desafio de criar nosso próprio controle com ela.\n Foi uma experiência divertida, criativa e cheia de movimento! 🎶🕹️⚡",

        "AU-17": "Eae Devs !\n Na aula de hoje, aprofundamos nossos conhecimentos em programação! Aprendemos o que são as funções, a diferença entre entrada e saída digital, e ainda fizemos uma boa revisão de condicionais, variáveis e broadcast.\n Foi uma aula cheia de conteúdo importante para criar projetos ainda mais inteligentes e interativos! ⚙️💡💻",

        "AU-18": "Terminando o nosso curso, muito obrigado por todos que seguiram até aqui, e rumo ao Ctrl+Kids 2, onde iremos explorar bem mais do mundo da programação de games.\n Hoje aprendemos como funcionam as animações no Scratch, deixando nossos projetos mais vivos e divertidos! Também finalizamos o jogo “Verdadeiro ou Falso?”, com muita interação e desafio.\n E pra fechar, montamos o circuito com o Makey Makey e criamos novos controles para testar e explorar ainda mais a criatividade!",

        "FEEDBACK-FINAL": "Parabéns, pessoal!\n Chegamos ao final dessa jornada incrível cheia de aprendizado e muita criatividade! Durante as aulas, vocês exploraram o mundo da programação com Scratch, criando projetos divertidos como o Catch Game e o Verdadeiro ou Falso?, onde colocaram em prática lógica, animação e interação.\n Também mergulhamos na arte digital com a pixel art, desenhando e animando personagens cheios de vida e cor, desenvolvendo a sensibilidade artística e o olhar para os detalhes.\n No universo da robótica, vocês aprenderam a programar o micro:bit, criando desde mensagens simples até os incríveis Micro Pets Animados, que lembram um pou cheio de personalidade e movimento.\n Foi muito gratificante ver cada um de vocês crescer e transformar ideias em projetos reais, usando tecnologia para se expressar e se divertir.\n E não tem como nos esquecermos do projeto jogando com bananas, não é mesmo kkkkkk. Espero que tenham se divertido tanto quanto aprenderam, meus agradecimentos novamente, e espero ver vocês nos próximos módulos.\n Continuem explorando, criando e programando — essa é só a primeira de muitas jornadas que vêm pela frente!"


    },
    "CTRL+KIDS2": {

        "AU-01": "SEJAM BEM VINDOS AO KIDS 2, COMO PRIMEIRA AULA ELA FOI CHEIA DE EMOÇÃO E SAUDADES, MAS BORA PRO CONTEÚDO.\n Nesta aula, nós estamos revisitando o micro-bit, porém agora, começamos a explorar o mundo da música! Aprendemos a reconhecer as notas musicais e conhecemos os blocos de música para programar sons incríveis.\n Também nos familiarizamos com o componente buzzer e descobrimos como adaptar o fone de ouvido para emitir som — super legal para deixar nossos projetos ainda mais interativos e barulhentos kkkk!",


        "AU-02": "Oi, turma do Kids 2! Tudo certo?\n Hoje construímos a estrutura do nosso próprio piano no micro:bit! Entendemos como ele funciona e começamos a trabalhar com variáveis, aprendendo o que são e como usá-las.\n Também praticamos a interpretação das variáveis para controlar a reprodução das notas musicais, deixando nosso piano cada vez mais afinado e divertido!\n Vamos ver a criatividade de vocês em ação semana que vem",

        "AU-03": "Eae, recém chegados do Kids 2\n Hoje foi dia de montar a estrutura do nosso sistema de som e conectar todos os componentes com cuidado.\n Programamos o sistema para responder aos botões do micro:bit e ao interruptor, além de construir um sistema luminoso super legal para a caixa de som.\n Depois de tudo pronto, testamos o projeto e nos divertimos muito vendo ele funcionar!\n Até a próxima aventura!",

        "AU-04": "Como é que vocês estão ?\n Hoje revisamos como usar variáveis na programação e exploramos os blocos da aba “Rádio”, aprendendo a enviar e receber mensagens entre micro:bits.\n Também conhecemos as funções e as strings, e treinamos bastante nossa lógica de programação para deixar nossos códigos cada vez melhores!\n Vocês estão mandando muito bem, bora continuar assim!\n A batata quente que fizemos hoje com o micro-bit foi sensacional kkkk",

        "AU-05": "O que acharam do Labirinto Elétrico:\n Hoje relembramos os conceitos que aprendemos nas aulas anteriores e colocamos em prática o uso de variáveis, dessa vez para controlar a pontuação do nosso novo projeto!\n Criamos juntos o jogo “Labirinto Elétrico”, combinando programação e criatividade. Foi muito divertido ver cada um de vocês explorando soluções e desafios!",

        "AU-06": "Bom dia, Boa Tarde, Boa Noite, como vocês estão ?\n Na aula de hoje imergimos no mundo da física e da tecnologia! Aprendemos os conceitos de deslocamento, tempo e velocidade, e vimos como esses elementos se unem no funcionamento de um radar de velocidade.\n Depois, montamos a estrutura do nosso próprio radar e o programamos no micro:bit, deixando tudo pronto para medir a velocidade de objetos em movimento. Foi incrível ver a criatividade de vocês em ação!\n Agora que montamos já entendemos como um radar de velocidade funciona.",

        "AU-07": "Hoje foi dia de explorar a natureza com tecnologia! Trabalhamos bastante a criatividade, aprendendo como usar o Micro:Bit para reconhecer os estados físicos da água encontrados no nosso dia a dia. Além disso, codificamos o Micro:Bit para medir a umidade do solo, unindo ciência e programação de um jeito super divertido e inteligente.",

        "AU-08": "🌱 Irrigador Automático com Micro:Bit!\n Na aula de hoje, colocamos a mão na massa para criar um sistema de irrigação inteligente! Os alunos:\n Montaram a estrutura do irrigador;\n Aprenderam a fazer as ligações corretas do Servo Motor com o Micro:Bit;\n Programaram o sistema para funcionar automaticamente!\n Mais uma etapa concluída com sucesso, unindo criatividade e tecnologia para cuidar das plantas de forma prática e divertida!",

        "AU-09": "🏁 Kodu Race: Corrida com Inteligência Artificial!\n Hoje foi dia de acelerar no mundo do Kodu! Os alunos criaram um jogo de corrida do zero, usando toda a criatividade para montar pistas desafiadoras e empolgantes. Além disso, programaram uma inteligência artificial capaz de competir com o jogador, tornando a experiência ainda mais dinâmica. Para fechar, trabalharam com o sistema de pontuação (scores), adicionando um toque competitivo e incentivando a melhoria contínua dentro do jogo. Foi uma aula cheia de lógica, estratégia e diversão! 🧠🎮",

        "AU-10": "🛡️ Kodu Invaders: Defenda-se dos inimigos!\n Na aula de hoje, os alunos exploraram novos objetos disponíveis no Kodu, ampliando ainda mais suas possibilidades criativas. Com esse conhecimento, programaram torres de proteção estrategicamente posicionadas para defender seu território dos invasores. O grande desafio foi sobreviver ao ataque programado, testando reflexos, lógica e planejamento. Uma aula cheia de ação e estratégia, onde cada decisão podia significar a vitória ou a derrota! 🚀👾",

        "AU-11": "⚽ Kodu Soccer: Uma partida de lógica e estratégia!\n Nesta aula, os alunos mergulharam no universo do futebol com o Kodu, criando seu próprio jogo com personagens e regras personalizadas. Aprenderam a utilizar subeventos para refinar o comportamento dos jogadores e programaram uma inteligência artificial capaz de competir dentro de campo. O resultado foi uma divertida partida onde lógica e criatividade foram os principais craques! 🧠🏆",

        "AU-12": "Oi, tudo bem? Preparado pro Next Level? 🎮🔥 Kodu feat. Micro:Bit!\n Chegou a hora de subir de nível! Nessa aula, os alunos revisitaram um dos jogos criados anteriormente e deram um upgrade total, programando novas fases e desafios. E o melhor: transformaram a Micro:Bit em um joystick real, tornando a experiência ainda mais imersiva e divertida. Foi o momento perfeito para testar, brincar e mostrar tudo o que aprenderam até aqui!",

        "AU-13": "E aí, prontos para criar seu primeiro app? 📱🚀 Introdução ao App Inventor!\n Hoje, os alunos entenderam o que é um aplicativo e conversaram sobre exemplos que já conhecem no dia a dia. Depois, aprenderam a acessar o App Inventor e a navegar pela sua interface, conhecendo os principais componentes usados para criar apps. O desafio final foi desenvolver um aplicativo criativo para identificar os habitantes do planeta Zorg — e o resultado foi sensacional! 👾🌍",

        "AU-14": "Dando voz ao app! 🔊 Entendendo o Text-to-Speech\n Explorar a comunicação entre humanos e máquinas de forma divertida foi o foco deste encontro. A turma revisou os principais componentes do App Inventor e também reforçou o uso de variáveis. O grande destaque ficou por conta do componente “TextoParaFalar”, que possibilitou transformar palavras digitadas em sons reais. Com isso, cada aluno criou um app interativo que falava frases ao toque de um botão — deixando os projetos mais dinâmicos e envolventes! 🗣️📱",

        "AU-15": "🌱 Tecnologia e o Meio Ambiente\n Na aula 15, os alunos exploraram como a tecnologia pode ajudar a preservar o meio ambiente. Para isso, criaram um aplicativo de quiz no qual construíram perguntas, respostas e toda a navegação entre telas. Foi uma oportunidade de exercitar tanto habilidades técnicas de programação quanto a consciência ambiental, integrando criatividade, lógica e reflexão sobre temas importantes para o futuro.",

        "AU-16": "🍀 Aplicativos Ajudando na Preservação\n Neste momento do projeto, os estudantes conheceram exemplos reais de aplicativos que atuam na preservação do meio ambiente. Aprenderam também como fazer diferentes telas de um app “conversarem” entre si e, assim, puderam concluir a programação de um quiz educativo. A proposta uniu tecnologia, consciência ambiental e pensamento lógico.",

        "AU-17": "📱 O Acelerômetro e Suas Aplicações\n Agora, faltando apenas duas aulas para acabar, os alunos descobriram como o acelerômetro — um dos sensores presentes em celulares — funciona e onde ele é utilizado no dia a dia, como em aplicativos de saúde, jogos e ferramentas de navegação. Com esse conhecimento, começaram a desenvolver um jogo interativo no qual o personagem se movimenta de acordo com a inclinação do celular. Além de aprender sobre sensores físicos e lógica de movimento, a turma explorou criatividade e raciocínio para construir uma experiência divertida e educativa.",

        "AU-18": "🌍 Separando para Preservar\n Encerrando com chave de ouro! Nesta última aula, os alunos se envolveram com um tema essencial: a importância da coleta seletiva e como pequenas atitudes podem gerar grandes impactos no cuidado com o meio ambiente. Com esse pano de fundo, revisaram conceitos de lógica condicional e conheceram novas ferramentas do App Inventor, como a “mochila”, que permite reutilizar trechos de programação. Tudo isso foi aplicado na finalização de um jogo educativo, em que o objetivo é separar corretamente os lixos, ganhar pontos e avançar de fase. Uma forma divertida e inteligente de consolidar o aprendizado — e de fechar esse ciclo com orgulho e muita empolgação!",

        "FEEDBACK-FINAL": "🌟 Encerramento do Semestre — Um Semestre de Grandes Conquistas!\n Chegamos ao fim de mais um semestre, e que jornada incrível foi essa! Durante esses meses, nossos(as) alunos(as) mergulharam em uma série de projetos criativos e desafiadores, envolvendo lógica, programação, design e tecnologia — tudo isso de forma prática, divertida e com um propósito.\n Começamos com o Kodu, criando mundos, jogos de corrida, defesas contra invasores e até partidas de futebol entre Kodus. Eles aprenderam conceitos de inteligência artificial, subeventos, pontuação e design de fases, sempre com um olhar curioso e criativo. Depois, avançamos para a integração com o Micro:Bit, desenvolvendo irrigadores inteligentes, sensores de umidade e jogos controlados por movimentos — uma combinação que exigiu lógica, paciência e trabalho em equipe.\n Na segunda parte do semestre, entramos no universo do App Inventor, criando aplicativos de verdade! Os alunos entenderam o que é uma interface, trabalharam com variáveis, blocos de programação, múltiplas telas, perguntas e respostas e até transformaram texto em voz com o recurso Text-to-Speech. Finalizamos com dois jogos incríveis: um controlado com o acelerômetro do celular e outro focado em coleta seletiva, promovendo a consciência ambiental e mostrando que tecnologia e sustentabilidade podem caminhar juntas.\n É importante dizer: tudo o que essas crianças fizeram não é simples. Criar jogos, pensar em regras, desenvolver soluções e ainda aplicar conceitos de programação exige MUITO raciocínio, criatividade, resiliência e dedicação. E eles conseguiram — com excelência!\n Estamos muito orgulhosos(as) do desempenho, da evolução e do envolvimento de cada um. Que esse semestre tenha plantado uma sementinha de interesse por tecnologia, inovação e pensamento lógico, porque eles estão indo longe — e com um futuro brilhante pela frente.\n Nos vemos no próximo semestre com ainda mais ideias, desafios e aprendizados! 🚀"
    },

    "CTRL+KIDS3": {

        "AU-01": "aa"
    }
}
